app/views/menus/index.json.jbuilder

SELECT  "meals".* FROM "meals"  WHERE "meals"."menu_id" = ? LIMIT 1  [["menu_id", 1]]
---
json.(@menus)  do |menu|
  if !menu.meal.fi.empty?