app/controllers/menus_controller.rb

  def index
  #returns static json currently
=begin
returnStaticJson
=end
  respond_to do |format|
    format.json do
      if Menu.first.nil? || Menu.first.created_at.to_time < 24.hours.ago
      @menus = JSON.parse(getMenus.body)
      render :json => @menus
      else
        @menus = Menu.all
        render :json => @menus.as_json,  :include=> [:url, :location], :except=> [:id, :created_at, :updated_at]
      end
      end
    format.html do
      @menus = Menu.all
---
INSERT INTO "menus" ("campus", "created_at", "name", "open", "updated_at") VALUES (?, ?, ?, ?, ?)  [["campus", "Kallio / Vallila"], ["created_at", "2014-05-07 13:13:43.136696"], ["name", "Arcada"], ["open", "Mon-Thu 10:45-15:15, Fri 10:45-14:30"], ["updated_at", "2014-05-07 13:13:43.136696"]]
SELECT  "menus".* FROM "menus"   ORDER BY "menus"."id" ASC LIMIT 1
SELECT  "locations".* FROM "locations"  WHERE "locations"."menu_id" = ? LIMIT 1  [["menu_id", 1]]
SELECT  "urls".* FROM "urls"  WHERE "urls"."menu_id" = ? LIMIT 1  [["menu_id", 1]]

    def set_menu
      @menu = Menu.find(params[:id])
---
SELECT  "menus".* FROM "menus"  WHERE "menus"."id" = ? LIMIT 1  [["id", 96]]