app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-09 12:38:16.565838"], ["email", "weequ@weequ.net"], ["name", "Weequ"], ["updated_at", "2014-05-09 12:38:16.565838"]]